tap "ck3mp3r/nu-mcp", "https://github.com/ck3mp3r/nu-mcp"
# All-in-one AI-Powered CLI Chat & Copilot
brew "aichat"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Generate compilation database for clang tooling
brew "bear"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Cross-platform make
brew "cmake"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima", restart_service: :changed
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# View disk space usage and delete unwanted data, fast
brew "dua-cli"
# Command-line tool to interact with exercism.io
brew "exercism"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Multi-platform library for OpenGL applications
brew "glfw"
# Render markdown on the CLI
brew "glow"
# Post-modern modal text editor
brew "helix"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Client library for huggingface.co hub
brew "huggingface-cli"
# Like IntelliSense, but for shells
brew "intelli-shell"
# Git-compatible distributed version control system
brew "jj"
# Environment diagnostics for Kotlin Multiplatform Mobile app development
brew "kdoctor"
# CLI agent for MoonshotAI Kimi platform
brew "kimi-cli"
# Simple terminal UI for git commands
brew "lazygit"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Next-gen compiler infrastructure
brew "llvm"
# Show markdown documents on text terminals
brew "mdcat"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Array framework for Apple silicon
brew "mlx"
# Run LLMs with MLX
brew "mlx-lm"
# NCurses Disk Usage
brew "ncdu"
# Utility for managing network connections
brew "netcat"
# Modern shell for the GitHub era
brew "nushell"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Ruby version manager
brew "rbenv"
# Safe, concurrent, practical language
brew "rust"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Formatting technology for Swift source code
brew "swift-format"
# User interface to the TELNET protocol
brew "telnet"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# AI-powered, non-intrusive terminal assistant
brew "tmuxai"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Language Server Protocol implementation for TypeScript wrapping tsserver
brew "typescript-language-server"
# Markup-based typesetting system
brew "typst"
# Extensible IRC client
brew "weechat"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# nu-mcp - Model Context Protocol (MCP) Server for Nushell
brew "ck3mp3r/nu-mcp/nu-mcp"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# AI Coding Agent IDE
cask "antigravity"
# Allows connection to a computer remotely
cask "anydesk"
# Chromium based browser
cask "arc"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Text, code, and markup editor
cask "bbedit"
# Web browser focusing on privacy
cask "brave-browser"
# E-books management software
cask "calibre"
# Terminal-based AI coding assistant
cask "claude-code"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# OpenAI's Codex desktop app for managing coding agents
cask "codex-app"
# Brings the power of Copilot coding agent directly to your terminal
cask "copilot-cli"
# Multi-platform client-side cloud file encryption tool
cask "cryptomator"
# Write, edit, and chat about your code with AI
cask "cursor"
# VPN client
cask "cyberghost-vpn"
# Photography workflow application and raw developer
cask "darktable"
# Web browser
cask "firefox"
cask "font-jetbrains-mono-nerd-font"
# GIT client
cask "fork"
# Finder replacement and FTP, SFTP, WebDAV and Amazon s3 client
cask "forklift"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Game development engine
cask "godot"
# Desktop GUI for Aider AI pair programming
cask "hotovo-aider-desk"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Password manager app
cask "keepassxc"
# Customise mouse behavior
cask "linearmouse"
# Discover, download, and run local LLMs
cask "lm-studio"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Syncs files between computers and MEGA Cloud drives
cask "megasync"
# Multi-platform web browser
cask "microsoft-edge"
# Privacy-focused note taking app
cask "notesnook"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# WebKit based web browser
cask "orion"
# Command-line shell and scripting language
cask "powershell"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Image viewer
cask "qview"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Spaced-repetition powered note-taking tool
cask "remnote"
# Local-first personal knowledge management system
cask "siyuan"
# Free, open-source, and completely encrypted notes app
cask "standard-notes"
# LaTeX and TeX editor and previewer
cask "texshop"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Rust-based terminal
cask "warp"
# Terminal emulator
cask "wave"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Image viewer and file browser
cask "xee"
# Photo viewer, image manager, image resiser and more
cask "xnviewmp"
# Multiplayer code editor
cask "zed"
# Gecko based web browser
cask "zen"
vscode "andenetalexander.vim-cheatsheet"
vscode "christian-kohler.npm-intellisense"
vscode "continue.continue"
vscode "csholmq.excel-to-markdown-table"
vscode "davidanson.vscode-markdownlint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "formulahendry.code-runner"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "james-yu.latex-workshop"
vscode "jasew.vscode-helix-emulation"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jpotterm.simple-vim"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "matepek.vscode-catch2-test-adapter"
vscode "mathematic.vscode-pdf"
vscode "matthewpi.caddyfile-support"
vscode "mdickin.markdown-shortcuts"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-speech"
vscode "nhoizey.gremlins"
vscode "pomdtr.excalidraw-editor"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sleistner.vscode-fileutils"
vscode "snowcrash30.printtimestamp"
vscode "softwaredotcom.swdc-vscode"
vscode "swiftlang.swift-vscode"
vscode "thomaz.preparing"
vscode "tinkertrain.theme-panda"
vscode "trunk.io"
vscode "twxs.cmake"
vscode "tyriar.vscode-terminal-here"
vscode "vadimcn.vscode-lldb"
vscode "vintharas.learn-vim"
vscode "vscodevim.vim"
vscode "will-stone.plastic"
vscode "xaver.clang-format"
vscode "yzhang.markdown-all-in-one"
cargo "mcp-server-nu"
